soldernerd/PIC18_USB_Bootloader/display.c

#include <xc.h>
#include <stdint.h>
#include <stdlib.h>
#include <string.h>
#include "display.h"
#include "i2c.h"
#include "os.h"
#include "rtcc.h"


char display_content[4][20];

static void _display_inout(void);
static void _display_time(uint8_t mode);

uint8_t display_get_character(uint8_t line, uint8_t position)
{
    return display_content[line][position];
}

static void _display_clear(void)
{
    uint8_t row;
    uint8_t col;
    for(row=0;row<4;++row)
    {
        for(col=0;col<20;++col)
        {
            display_content[row][col] = ' ';
        }
    }
}

static void _display_itoa(int16_t value, uint8_t decimals, char *text)
{
    uint8_t pos;
    uint8_t len;
    int8_t missing;
    char tmp[10];
    itoa(tmp, value, 10);
    len = strlen(tmp);
    
    if(value<0) //negative values
    {
        missing = decimals + 2 - len;
        if(missing>0) //zero-padding needed
        {
            for(pos=decimals;pos!=0xFF;--pos)
            {
                if(pos>=missing) //there is a character to copy
                {
                    tmp[pos+1] = tmp[pos+1-missing];
                }
                else //there is no character
                {
                    tmp[pos+1] = '0';
                }
            }
            len = decimals + 2;
        }  
    }
    else
    {
        missing = decimals + 1 - len;
        if(missing>0) //zero-padding needed
        {
            for(pos=decimals;pos!=0xFF;--pos)
            {
                if(pos>=missing) //there is a character to copy
                {
                    tmp[pos] = tmp[pos-missing];
                }
                else //there is no character
                {
                    tmp[pos] = '0';
                }
            }
            len = decimals + 1;
        }       
    }
 
    decimals = len - decimals - 1;
    
    for(pos=0;pos<len;++pos)
    {
        text[pos] = tmp[pos];
        if(pos==decimals)
        {
            //Insert decimal point
            ++pos;
            text[pos] = '.';
            break;
        }
    }
    for(;pos<len;++pos)
    {
        text[pos+1] = tmp[pos];
    }
}

void display_prepare(uint8_t mode)
{
    _display_clear();
    
    switch(mode&0xF0)
    {
        case DISPLAY_MODE_OVERVIEW:
            _display_inout();
            break;
        case DISPLAY_MODE_DATETIME_OVERVIEW:
            _display_time(mode);
            break;
        default:
            _display_inout();
    }
}

static void _display_inout(void)
{
    uint8_t cntr;
    const char line1[] = "Voltage & Current";
    const char line2[] = "   Input   Output";
    const char line3[] = "V:";
    const char line4[] = "A: --      --";
    
    cntr = 0;
    while(line1[cntr])
        display_content[0][cntr] = line1[cntr++];
    
    cntr = 0;
    while(line2[cntr])
        display_content[1][cntr] = line2[cntr++]; 
    
    cntr = 0;
    while(line3[cntr])
        display_content[2][cntr] = line3[cntr++]; 
        _display_itoa(os.input_voltage, 3, &display_content[2][3]);
        _display_itoa(os.output_voltage, 3, &display_content[2][11]);
    
    cntr = 0;
    while(line4[cntr])
        display_content[3][cntr] = line4[cntr++];
    
}

void display_update(void)
{
    i2c_display_cursor(0, 0);
    i2c_display_write_fixed(&display_content[0][0], 20);
    i2c_display_cursor(1, 0);
    i2c_display_write_fixed(&display_content[1][0], 20);
    i2c_display_cursor(2, 0);
    i2c_display_write_fixed(&display_content[2][0], 20);
    i2c_display_cursor(3, 0);
    i2c_display_write_fixed(&display_content[3][0], 20);
}

static void _display_time(uint8_t mode)
{
    const char tad[] = "Time and Date";
    const char setyear[] = "Set year";
    const char setmonth[] = "Set month";
    const char setday[] = "Set day";
    const char sethours[] = "Set hours";
    const char setminutes[] = "Set minutes";
    const char setseconds[] = "Set seconds";
    const char pts[] = "->Press to set time";
    const char pressmonth[] = "->Press for month";
    const char pressday[] = "->Press for day";
    const char presshours[] = "->Press for hours";
    const char pressminutes[] = "->Press for minutes";
    const char pressseconds[] = "->Press for seconds";
    const char presssave[] = "->Press to save";
    
    uint8_t cntr;
    uint8_t year = rtcc_get_year();
    uint8_t month = rtcc_get_month();
    uint8_t day = rtcc_get_day();
    uint8_t hours = rtcc_get_hours();
    uint8_t minutes = rtcc_get_minutes();
    uint8_t seconds = rtcc_get_seconds();
    
    switch(mode)
    {
        case DISPLAY_MODE_DATETIME_OVERVIEW:
            cntr = 0;
            while(tad[cntr])
                display_content[0][cntr] = tad[cntr++];
            cntr = 0;
            while(pts[cntr])
                display_content[3][cntr] = pts[cntr++];    
            break;
            
        case DISPLAY_MODE_DATETIME_YEAR:
            cntr = 0;
            while(setyear[cntr])
                display_content[0][cntr] = setyear[cntr++];
            cntr = 0;
            while(pressmonth[cntr])
                display_content[3][cntr] = pressmonth[cntr++];    
            break;
            
        case DISPLAY_MODE_DATETIME_MONTH:
            cntr = 0;
            while(setmonth[cntr])
                display_content[0][cntr] = setmonth[cntr++];
            cntr = 0;
            while(pressday[cntr])
                display_content[3][cntr] = pressday[cntr++];    
            break;
            
        case DISPLAY_MODE_DATETIME_DAY:
            cntr = 0;
            while(setday[cntr])
                display_content[0][cntr] = setday[cntr++];
            cntr = 0;
            while(presshours[cntr])
                display_content[3][cntr] = presshours[cntr++];    
            break;
            
        case DISPLAY_MODE_DATETIME_HOURS:
            cntr = 0;
            while(sethours[cntr])
                display_content[0][cntr] = sethours[cntr++];
            cntr = 0;
            while(pressminutes[cntr])
                display_content[3][cntr] = pressminutes[cntr++];    
            break;
            
        case DISPLAY_MODE_DATETIME_MINUTES:
            cntr = 0;
            while(setminutes[cntr])
                display_content[0][cntr] = setminutes[cntr++];
            cntr = 0;
            while(pressseconds[cntr])
                display_content[3][cntr] = pressseconds[cntr++];    
            break;
            
        case DISPLAY_MODE_DATETIME_SECONDS:
            cntr = 0;
            while(setseconds[cntr])
                display_content[0][cntr] = setseconds[cntr++];
            cntr = 0;
            while(presssave[cntr])
                display_content[3][cntr] = presssave[cntr++];    
            break;
    }

    //Year
    display_content[1][0] = '2';
    display_content[1][1] = '0';
    display_content[1][2] = (year>>4) + 48;
    display_content[1][3] = (year&0x0F) + 48;
    //Month
    display_content[1][4] = '-';
    display_content[1][5] = (month>>4) + 48;
    display_content[1][6] = (month&0x0F) + 48;
    //Day
    display_content[1][7] = '-';
    display_content[1][8] = (day>>4) + 48;
    display_content[1][9] = (day&0x0F) + 48;
    //Hours
    display_content[2][0] = (hours>>4) + 48;
    display_content[2][1] = (hours&0x0F) + 48;
    //Month
    display_content[2][2] = ':';
    display_content[2][3] = (minutes>>4) + 48;
    display_content[2][4] = (minutes&0x0F) + 48;
    //Day
    display_content[2][5] = ':';
    display_content[2][6] = (seconds>>4) + 48;
    display_content[2][7] = (seconds&0x0F) + 48;  
}
